<?php

namespace Database\Seeders;

use Illuminate\Database\Console\Seeds\WithoutModelEvents;
use Illuminate\Database\Seeder;

class DatabaseSeeder extends Seeder
{
    /**
     * Seed the application's database.
     *
     * @return void
     */
    public function run()
    {
        // \App\Models\User::factory(10)->create();

        // \App\Models\User::factory()->create([
        //     'name' => 'Test User',
        //     'email' => 'test@example.com',
        // ]);
        \App\Models\Content::create([
            'whatOffer' => ' تعمـل فور ميديا علـى تلبيـه احتياجــات العمـلاء مـن خـلال تقديــم باقــة مــن الخدمــات الرقميــة التــي تســاهم فــي تحسين الظهور على الانترنت والإعلام الاجتماعي',
            'OurMessage' => ' نسـعى فـي مؤسسـة فـور ميديـا للارتقـاء فـي كافـة مجـالات تكنولوجيــا الملعومــات مــن خــلال مــا تقدمــه مــن خدمــات مناســبة وأعمــال الأفــراد والشــركات بأعلــى جــودة وفــي أســرع وقــت لتحيــق الأهــداف وبنــاء العلاقــات القويــة مــع العملاء              ',
            'whoWe' => ' شركة فور ميديا لتقديم حـلول رقمـــية احـترافــية للـتصـامـــيم  الدعائية والتسويق الالكتروني وإنتاج موشن جرافيك، وتصــميم المواقع، والمتاجر الإلكترونية وتطبيقات الجوال. نقـوم بكافـة أعمالنـا مـن خـلال مجموعـة مـن المتخصصيـن  فـي ً المجـال والمدربيـن علـى أعلـى مسـتويات لخبـرة والكفـاءة. دائمـا تســعى شــركاتنا للإبــداع فــي كافــة مــا تقدمــه مــن أعمــال لعملائها',
            'mechanismWork' => ' التخطيط وتنظيم العمل أحد أهم أسرار نجاحنـا حيث نخطط مع عملائنا حول كيفية تحقيق أهدافهم وتطوير أعمالهم و مـن المهـم إيضـاح عمليـة تواصـل الزبائـن مـع الشـركة',
        ]);
    }
}
